Revit 2027 API
DocumentSavedAsEventArgs.IsSavingAsCentralFile Property
 Indicates whether the document is to be saved as central file.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSavingAsCentralFile { get; }
Public ReadOnly Property IsSavingAsCentralFile As Boolean
	Get
public:
property bool IsSavingAsCentralFile {
	bool get ();
}
member IsSavingAsCentralFile : bool with get
Property Value
Boolean
See Also
Reference
DocumentSavedAsEventArgs Class
Autodesk.Revit.DB.Events Namespace